# hanhwa_beyound_sw_camp-
1주차

FACTS
이번 일주일 동안에는 기본적인 리눅스 조작법과 DB의 기본 문법을 배웠습니다. 저는 그날에 배운 것을 집에 가는 길에 복습을 하였습니다.  집에 도착해서는 백준의 문제를 풀었습니다. 

FEELINGS
전공자라 그런지 몰라도 처음에 배운 내용들은 학교에서 배운것과 많이 다른게 없어서 따라가기가 굉장히 수월했던 것 같습니다. 하지만 집에가서 백준의 문제들을 풀어보니 아직 많이 부족하다고 느꼈습니다. 그로 인해 공부를 더 해야겠다고 느껴 유튜브에 잘 설명해둔 자바의 기본 개념들을 찾아서 들었습니다. 

FINDINGS 
백준의 문제들을 풀다보면 분명히 아는데 어떻게 풀어내야 할지 모르겠는 또는 개념자체를 몰라 못 푸는 상황이 생겼습니다. 원래 같았다면 AI에게 물어보았겠지만 그렇게 해서는 실력이 늘지 않는다는 걸 알아. 구글에 기본적인 개념만 물어보고 부족한 부분을 알고 학습을 하였습니다. 

FUTURE 
위에 글처럼 부족한 부분에 대한 학습을 계속하며 집에 갈때,학원에 올때, 계속해서 리뷰를 하며 이해를 할 것 입니다. 이해한 걸 바탕으로 백준의 문제나 다른 문제가 생겼을 때 최대한 이해하고 아는 걸 바탕으로 풀려고 노력을 할 것입니다
